---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Description
source: html/6872b1db-5f9e-72bb-b66f-b9c20f7cc597.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Description Property

The description of the parameter definition to be created. The description will be used as tooltip in the
 Revit UI including in the properties palette.
 The default is an empty string.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null